import os

sandbox_folder = "My_Sandbox"
open(os.path.join(sandbox_folder, "fake_tool.dll"), "w").close()

# 1. os.path.join(sandbox_folder, "fake_tool.dll")
# "ตั้งชื่อและระบุที่อยู่ไฟล์"
# เราบอก Python ว่า "ช่วยสร้างที่อยู่ไฟล์ในโฟลเดอร์ My_Sandbox
# และให้ไฟล์ชื่อว่า fake_tool.dll
# ผลลัพธ์ที่ได้จะเป็น My_Sandbox/fake_tool.dll

# 2. open(..., "w")
# "สั่งเปิดไฟล์"
# open(ที่อยู่ไฟล์, "w"): เป็นการบอกคอมพิวเตอร์ว่า "ช่วยไปเปิดไฟล์ตามที่อยู่นี้ให้หน่อยนะ"
# โหมด "w" (Write): มีคุณสมบัติพิเศษคือ "ถ้ายังไม่มีไฟล์ชื่อนี้อยู่ มันจะสร้างให้ใหม่ทันที"
# แต่ถ้ามีอยู่แล้ว มันจะลบข้อมูลเก่าทิ้งจนกลายเป็นไฟล์ว่างเปล่า

# 3. .close()
# "สั่งปิดไฟล์"
# เมื่อเราเปิดไฟล์ด้วยคำสั่ง open() แล้ว เราควรปิดมันเสมอเพื่อให้ระบบคืนหน่วยความจำ (RAM)
# และปล่อยให้โปรแกรมอื่นเข้าถึงไฟล์นั้นได้
# ในบรรทัดนี้ เราไม่ได้เขียนข้อมูลอะไรลงไปเลย (Write nothing) เราแค่
# เปิดเพื่อสั่งให้มันสร้างไฟล์ขึ้นมา แล้วก็ ปิดทันที ผลที่ได้คือเราจะได้
# "ไฟล์เปล่าที่มีขนาด 0 Byte" ครับ

# ปกติเราจะเขียนแบบนี้ครับ ซึ่งให้ผลเหมือนกันเป๊ะ แต่อ่านง่ายกว่าสำหรับมือใหม่
# 1. สร้างที่อยู่
path = os.path.join(sandbox_folder, "test.dll")

# 2. เปิดไฟล์ (สร้างไฟล์)
f = open(path, "w")

# 3. ปิดไฟล์
f.close()